emirhan-sonmez/chibios/os/hal/ports/STM32/STM32U5xx/hal_lld.c
/*
    ChibiOS - Copyright (C) 2006-2026 Giovanni Di Sirio.

    Licensed under the Apache License, Version 2.0 (the "License");
    you may not use this file except in compliance with the License.
    You may obtain a copy of the License at

        http://www.apache.org/licenses/LICENSE-2.0

    Unless required by applicable law or agreed to in writing, software
    distributed under the License is distributed on an "AS IS" BASIS,
    WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
    See the License for the specific language governing permissions and
    limitations under the License.
*/

/**
 * @file    STM32U5xx/hal_lld.c
 * @brief   STM32U5xx HAL subsystem low level driver source.
 *
 * @addtogroup HAL
 * @{
 */

#include "hal.h"

/*===========================================================================*/
/* Driver local definitions.                                                 */
/*===========================================================================*/

/**
 * @name    Registers reset values
 * @{
 */
#define STM32_PWR_VOSR_RESET            (PWR_VOSR_VOS_RANGE4 | PWR_VOSR_VOSRDY)
#define STM32_FLASH_ACR_RESET           FLASH_ACR_LATENCY_3WS
#define STM32_RCC_CR_RESET              (RCC_CR_MSISON | RCC_CR_MSIKERON |  \
                                         RCC_CR_MSIKON)
#define STM32_RCC_ICSCR1_RESET          (RCC_ICSCR1_MSIRGSEL_ICSCR1 |      \
                                         RCC_ICSCR1_MSISRANGE_RANGE4_4M |   \
                                         RCC_ICSCR1_MSIKRANGE_RANGE4_4M)
#define STM32_RCC_CFGR1_RESET           0U
#if (STM32_CLOCKTREE_VARIANT_U575 == TRUE) ||                               \
    (STM32_CLOCKTREE_VARIANT_U585 == TRUE)
#define STM32_RCC_CFGR2_RESET           0U
#else
#define STM32_RCC_CFGR2_RESET           0x00006000U
#endif
#define STM32_RCC_CFGR3_RESET           0U
#define STM32_RCC_BDCR_RESET            0U
#define STM32_RCC_CCIPR1_RESET          0U
#define STM32_RCC_CCIPR2_RESET          0U
#define STM32_RCC_CCIPR3_RESET          0U
#define STM32_RCC_PLL1CFGR_RESET        0U
#define STM32_RCC_PLL2CFGR_RESET        0U
#define STM32_RCC_PLL3CFGR_RESET        0U
#define STM32_RCC_PLL1DIVR_RESET        0x01010280U
#define STM32_RCC_PLL1FRACR_RESET       0U
#define STM32_RCC_PLL2DIVR_RESET        0x01010280U
#define STM32_RCC_PLL2FRACR_RESET       0U
#define STM32_RCC_PLL3DIVR_RESET        0x01010280U
#define STM32_RCC_PLL3FRACR_RESET       0U
/** @} */

#define STM32_WS_THRESHOLDS             16U

#if (STM32_CLOCKTREE_VARIANT_U595 == TRUE) ||                               \
    (STM32_CLOCKTREE_VARIANT_U5A5 == TRUE)
#define STM32_RCC_CFGR2_FIXED_BITS      0x00006000U
#else
#define STM32_RCC_CFGR2_FIXED_BITS      0U
#endif

#if STM32_BOOSTER_ENABLED == TRUE
#define STM32_PWR_VOSR_DEFAULT          (STM32_CFG_PWR_VOSR | PWR_VOSR_BOOSTEN)
#else
#define STM32_PWR_VOSR_DEFAULT          STM32_CFG_PWR_VOSR
#endif

/*===========================================================================*/
/* Driver exported variables.                                                */
/*===========================================================================*/

/**
 * @brief   CMSIS system core clock variable.
 * @note    It is declared in system_stm32u5xx.h.
 */
uint32_t SystemCoreClock;

/**
 * @brief   Post-reset clock configuration.
 */
const halclkcfg_t hal_clkcfg_reset = {
  .pwr_vosr             = STM32_PWR_VOSR_RESET,
  .rcc_cr               = STM32_RCC_CR_RESET,
  .rcc_icscr1           = STM32_RCC_ICSCR1_RESET,
  .rcc_cfgr1            = STM32_RCC_CFGR1_RESET,
  .rcc_cfgr2            = STM32_RCC_CFGR2_RESET,
  .rcc_cfgr3            = STM32_RCC_CFGR3_RESET,
  .rcc_bdcr             = STM32_RCC_BDCR_RESET,
  .rcc_ccipr1           = STM32_RCC_CCIPR1_RESET,
  .rcc_ccipr2           = STM32_RCC_CCIPR2_RESET,
  .rcc_ccipr3           = STM32_RCC_CCIPR3_RESET,
  .flash_acr            = STM32_FLASH_ACR_RESET,
  .plls = {
    [0] = {
      .cfgr             = STM32_RCC_PLL1CFGR_RESET,
      .divr             = STM32_RCC_PLL1DIVR_RESET,
      .fracr            = STM32_RCC_PLL1FRACR_RESET
    },
    [1] = {
      .cfgr             = STM32_RCC_PLL2CFGR_RESET,
      .divr             = STM32_RCC_PLL2DIVR_RESET,
      .fracr            = STM32_RCC_PLL2FRACR_RESET
    },
    [2] = {
      .cfgr             = STM32_RCC_PLL3CFGR_RESET,
      .divr             = STM32_RCC_PLL3DIVR_RESET,
      .fracr            = STM32_RCC_PLL3FRACR_RESET
    }
  }
};

/**
 * @brief   Default clock configuration.
 * @note    This is the configuration defined in mcuconf.h.
 */
const halclkcfg_t hal_clkcfg_default = {
  .pwr_vosr             = STM32_PWR_VOSR_DEFAULT,
  .rcc_cr               = STM32_CR_HSI16_BITS  | STM32_CR_HSI48_BITS |
                          STM32_CR_SHSI_BITS   | STM32_CR_HSE_BITS   |
                          STM32_CR_MSIS_BITS   | STM32_CR_MSIK_BITS  |
#if STM32_PLL1VCO_ENABLED == TRUE
                          RCC_CR_PLL1ON        |
#endif
#if STM32_PLL2VCO_ENABLED == TRUE
                          RCC_CR_PLL2ON        |
#endif
#if STM32_PLL3VCO_ENABLED == TRUE
                          RCC_CR_PLL3ON        |
#endif
                          0U,
  .rcc_icscr1           = STM32_MSISRC_BITS    | STM32_MSISDIV_BITS  |
                          STM32_MSIKRC_BITS    | STM32_MSIKDIV_BITS  |
                          STM32_ICSCR1_MSIS_BITS |
                          STM32_ICSCR1_MSIK_BITS,
  .rcc_cfgr1            = STM32_MCODIV_BITS    | STM32_MCO_BITS      |
                          STM32_SYSCLK_BITS    | STM32_CFG_STOPWUCK  |
                          STM32_CFG_STOPKERWUCK,
  .rcc_cfgr2            = STM32_HCLK_BITS      | STM32_PCLK1_BITS    |
                          STM32_PCLK2_BITS     | STM32_DPHY_BITS     |
                          STM32_RCC_CFGR2_FIXED_BITS,
  .rcc_cfgr3            = STM32_PCLK3_BITS,
  .rcc_bdcr             = STM32_BDCR_LSE_BITS  | STM32_BDCR_LSI_BITS |
                          STM32_BDCR_LSESYS_BITS |
                          STM32_RTC_BITS       | STM32_LSCO_BITS,
  .rcc_ccipr1           = STM32_USART1_BITS    | STM32_USART2_BITS   |
                          STM32_USART3_BITS    | STM32_UART4_BITS    |
                          STM32_UART5_BITS     | STM32_I2C1_BITS     |
                          STM32_I2C2_BITS      | STM32_I2C4_BITS     |
                          STM32_SPI2_BITS      | STM32_LPTIM2_BITS   |
                          STM32_SPI1_BITS      | STM32_SYSTICK_BITS  |
                          STM32_FDCAN1_BITS    | STM32_ICLK_BITS     |
                          STM32_CFG_TIMICSEL,
  .rcc_ccipr2           = STM32_MDF1_BITS      | STM32_SAI1_BITS     |
                          STM32_SAI2_BITS      | STM32_SAES_BITS     |
                          STM32_RNG_BITS       | STM32_SDMMC_BITS    |
                          STM32_DSI_BITS       | STM32_USART6_BITS   |
                          STM32_LTDC_BITS      | STM32_OCTOSPI_BITS  |
                          STM32_HSPI1_BITS     | STM32_I2C5_BITS     |
                          STM32_I2C6_BITS      | STM32_USBPHYC_BITS,
  .rcc_ccipr3           = STM32_LPUART1_BITS   | STM32_SPI3_BITS     |
                          STM32_I2C3_BITS      | STM32_LPTIM34_BITS  |
                          STM32_LPTIM1_BITS    | STM32_ADCDAC_BITS   |
                          STM32_DAC1SH_BITS    | STM32_ADF1_BITS,
  .flash_acr            = (STM32_FLASH_ACR & ~FLASH_ACR_LATENCY_Msk) |
                          STM32_FLASHBITS,
  .plls = {
    [0] = {
      .cfgr             = STM32_PLL1IN_BITS    | STM32_PLL1REF_BITS  |
                          STM32_PLL1MBOOST_BITS |
#if STM32_PLL1P_ENABLED == TRUE
                          RCC_PLL1CFGR_PLL1PEN |
#endif
#if STM32_PLL1Q_ENABLED == TRUE
                          RCC_PLL1CFGR_PLL1QEN |
#endif
#if STM32_PLL1R_ENABLED == TRUE
                          RCC_PLL1CFGR_PLL1REN |
#endif
                          0U,
      .divr             = STM32_PLL1VCO_BITS   | STM32_PLL1P_BITS    |
                          STM32_PLL1Q_BITS     | STM32_PLL1R_BITS,
      .fracr            = STM32_RCC_PLL1FRACR_RESET
    },
    [1] = {
      .cfgr             = STM32_PLL2IN_BITS    | STM32_PLL2REF_BITS  |
#if STM32_PLL2P_ENABLED == TRUE
                          RCC_PLL2CFGR_PLL2PEN |
#endif
#if STM32_PLL2Q_ENABLED == TRUE
                          RCC_PLL2CFGR_PLL2QEN |
#endif
#if STM32_PLL2R_ENABLED == TRUE
                          RCC_PLL2CFGR_PLL2REN |
#endif
                          0U,
      .divr             = STM32_PLL2VCO_BITS   | STM32_PLL2P_BITS    |
                          STM32_PLL2Q_BITS     | STM32_PLL2R_BITS,
      .fracr            = STM32_RCC_PLL2FRACR_RESET
    },
    [2] = {
      .cfgr             = STM32_PLL3IN_BITS    | STM32_PLL3REF_BITS  |
#if STM32_PLL3P_ENABLED == TRUE
                          RCC_PLL3CFGR_PLL3PEN |
#endif
#if STM32_PLL3Q_ENABLED == TRUE
                          RCC_PLL3CFGR_PLL3QEN |
#endif
#if STM32_PLL3R_ENABLED == TRUE
                          RCC_PLL3CFGR_PLL3REN |
#endif
                          0U,
      .divr             = STM32_PLL3VCO_BITS   | STM32_PLL3P_BITS    |
                          STM32_PLL3Q_BITS     | STM32_PLL3R_BITS,
      .fracr            = STM32_RCC_PLL3FRACR_RESET
    }
  }
};

/*===========================================================================*/
/* Driver local variables and types.                                         */
/*===========================================================================*/

