emirhan-sonmez/chibios/os/hal/ports/STM32/STM32U5xx/hal_lld.c
#if defined(HAL_LLD_USE_CLOCK_MANAGEMENT) || defined(__DOXYGEN__)
/**
 * @brief   Type of a structure representing dynamic system limits.
 */
typedef struct {
  halfreq_t             pllin_min;
  halfreq_t             pllin_max;
  halfreq_t             pllvco_min;
  halfreq_t             pllvco_max;
  halfreq_t             pllp_min;
  halfreq_t             pllp_max;
  halfreq_t             pllq_min;
  halfreq_t             pllq_max;
  halfreq_t             pllr_min;
  halfreq_t             pllr_max;
  halfreq_t             sysclk_max;
  halfreq_t             hclk_max;
  halfreq_t             pclk1_max;
  halfreq_t             pclk2_max;
  halfreq_t             pclk3_max;
  halfreq_t             flash_thresholds[STM32_WS_THRESHOLDS];
} system_limits_t;

/**
 * @brief   Dynamic clock points for this device.
 * @note    Pre-initialized because clock_init() runs before DATA/BSS
 *          initialization.
 */
static halfreq_t clock_points[CLK_ARRAY_SIZE] = {
  [CLK_HSI16]           = STM32_HSI16_FREQ,
  [CLK_HSI48]           = STM32_HSI48_FREQ,
  [CLK_SHSI]            = STM32_SHSI_FREQ,
  [CLK_HSE]             = STM32_HSE_FREQ,
  [CLK_MSIS]            = STM32_MSIS_FREQ,
  [CLK_MSIK]            = STM32_MSIK_FREQ,
  [CLK_PLL1P]           = STM32_PLL1P_FREQ,
  [CLK_PLL1Q]           = STM32_PLL1Q_FREQ,
  [CLK_PLL1R]           = STM32_PLL1R_FREQ,
  [CLK_PLL2P]           = STM32_PLL2P_FREQ,
  [CLK_PLL2Q]           = STM32_PLL2Q_FREQ,
  [CLK_PLL2R]           = STM32_PLL2R_FREQ,
  [CLK_PLL3P]           = STM32_PLL3P_FREQ,
  [CLK_PLL3Q]           = STM32_PLL3Q_FREQ,
  [CLK_PLL3R]           = STM32_PLL3R_FREQ,
  [CLK_SYSCLK]          = STM32_SYSCLK_FREQ,
  [CLK_HCLK]            = STM32_HCLK_FREQ,
  [CLK_PCLK1]           = STM32_PCLK1_FREQ,
  [CLK_PCLK1TIM]        = STM32_PCLK1TIM_FREQ,
  [CLK_PCLK2]           = STM32_PCLK2_FREQ,
  [CLK_PCLK2TIM]        = STM32_PCLK2TIM_FREQ,
  [CLK_PCLK3]           = STM32_PCLK3_FREQ,
  [CLK_MCO]             = STM32_MCO_FREQ
};

/**
 * @brief   System limits for VOS range 1.
 */
static const system_limits_t vos_range1 = {
  .pllin_min            = STM32_VOS1_PLLIN_MIN,
  .pllin_max            = STM32_VOS1_PLLIN_MAX,
  .pllvco_min           = STM32_VOS1_PLLVCO_MIN,
  .pllvco_max           = STM32_VOS1_PLLVCO_MAX,
  .pllp_min             = STM32_VOS1_PLLP_MIN,
  .pllp_max             = STM32_VOS1_PLLP_MAX,
  .pllq_min             = STM32_VOS1_PLLQ_MIN,
  .pllq_max             = STM32_VOS1_PLLQ_MAX,
  .pllr_min             = STM32_VOS1_PLLR_MIN,
  .pllr_max             = STM32_VOS1_PLLR_MAX,
  .sysclk_max           = STM32_VOS1_SYSCLK_MAX,
  .hclk_max             = STM32_VOS1_HCLK_MAX,
  .pclk1_max            = STM32_VOS1_PCLK1_MAX,
  .pclk2_max            = STM32_VOS1_PCLK2_MAX,
  .pclk3_max            = STM32_VOS1_PCLK3_MAX,
  .flash_thresholds     = {STM32_VOS1_FLASH_0WS_MAX,
                           STM32_VOS1_FLASH_1WS_MAX,
                           STM32_VOS1_FLASH_2WS_MAX,
                           STM32_VOS1_FLASH_3WS_MAX,
                           STM32_VOS1_FLASH_4WS_MAX,
                           STM32_VOS1_FLASH_5WS_MAX,
                           STM32_VOS1_FLASH_6WS_MAX,
                           STM32_VOS1_FLASH_7WS_MAX,
                           STM32_VOS1_FLASH_8WS_MAX,
                           STM32_VOS1_FLASH_9WS_MAX,
                           STM32_VOS1_FLASH_10WS_MAX,
                           STM32_VOS1_FLASH_11WS_MAX,
                           STM32_VOS1_FLASH_12WS_MAX,
                           STM32_VOS1_FLASH_13WS_MAX,
                           STM32_VOS1_FLASH_14WS_MAX,
                           STM32_VOS1_FLASH_15WS_MAX}
};

/**
 * @brief   System limits for VOS range 2.
 */
static const system_limits_t vos_range2 = {
  .pllin_min            = STM32_VOS2_PLLIN_MIN,
  .pllin_max            = STM32_VOS2_PLLIN_MAX,
  .pllvco_min           = STM32_VOS2_PLLVCO_MIN,
  .pllvco_max           = STM32_VOS2_PLLVCO_MAX,
  .pllp_min             = STM32_VOS2_PLLP_MIN,
  .pllp_max             = STM32_VOS2_PLLP_MAX,
  .pllq_min             = STM32_VOS2_PLLQ_MIN,
  .pllq_max             = STM32_VOS2_PLLQ_MAX,
  .pllr_min             = STM32_VOS2_PLLR_MIN,
  .pllr_max             = STM32_VOS2_PLLR_MAX,
  .sysclk_max           = STM32_VOS2_SYSCLK_MAX,
  .hclk_max             = STM32_VOS2_HCLK_MAX,
  .pclk1_max            = STM32_VOS2_PCLK1_MAX,
  .pclk2_max            = STM32_VOS2_PCLK2_MAX,
  .pclk3_max            = STM32_VOS2_PCLK3_MAX,
  .flash_thresholds     = {STM32_VOS2_FLASH_0WS_MAX,
                           STM32_VOS2_FLASH_1WS_MAX,
                           STM32_VOS2_FLASH_2WS_MAX,
                           STM32_VOS2_FLASH_3WS_MAX,
                           STM32_VOS2_FLASH_4WS_MAX,
                           STM32_VOS2_FLASH_5WS_MAX,
                           STM32_VOS2_FLASH_6WS_MAX,
                           STM32_VOS2_FLASH_7WS_MAX,
                           STM32_VOS2_FLASH_8WS_MAX,
                           STM32_VOS2_FLASH_9WS_MAX,
                           STM32_VOS2_FLASH_10WS_MAX,
                           STM32_VOS2_FLASH_11WS_MAX,
                           STM32_VOS2_FLASH_12WS_MAX,
                           STM32_VOS2_FLASH_13WS_MAX,
                           STM32_VOS2_FLASH_14WS_MAX,
                           STM32_VOS2_FLASH_15WS_MAX}
};

/**
 * @brief   System limits for VOS range 3.
 */
static const system_limits_t vos_range3 = {
  .pllin_min            = STM32_VOS3_PLLIN_MIN,
  .pllin_max            = STM32_VOS3_PLLIN_MAX,
  .pllvco_min           = STM32_VOS3_PLLVCO_MIN,
  .pllvco_max           = STM32_VOS3_PLLVCO_MAX,
  .pllp_min             = STM32_VOS3_PLLP_MIN,
  .pllp_max             = STM32_VOS3_PLLP_MAX,
  .pllq_min             = STM32_VOS3_PLLQ_MIN,
  .pllq_max             = STM32_VOS3_PLLQ_MAX,
  .pllr_min             = STM32_VOS3_PLLR_MIN,
  .pllr_max             = STM32_VOS3_PLLR_MAX,
  .sysclk_max           = STM32_VOS3_SYSCLK_MAX,
  .hclk_max             = STM32_VOS3_HCLK_MAX,
  .pclk1_max            = STM32_VOS3_PCLK1_MAX,
  .pclk2_max            = STM32_VOS3_PCLK2_MAX,
  .pclk3_max            = STM32_VOS3_PCLK3_MAX,
  .flash_thresholds     = {STM32_VOS3_FLASH_0WS_MAX,
                           STM32_VOS3_FLASH_1WS_MAX,
                           STM32_VOS3_FLASH_2WS_MAX,
                           STM32_VOS3_FLASH_3WS_MAX,
                           STM32_VOS3_FLASH_4WS_MAX,
                           STM32_VOS3_FLASH_5WS_MAX,
                           STM32_VOS3_FLASH_6WS_MAX,
                           STM32_VOS3_FLASH_7WS_MAX,
                           STM32_VOS3_FLASH_8WS_MAX,
                           STM32_VOS3_FLASH_9WS_MAX,
                           STM32_VOS3_FLASH_10WS_MAX,
                           STM32_VOS3_FLASH_11WS_MAX,
                           STM32_VOS3_FLASH_12WS_MAX,
                           STM32_VOS3_FLASH_13WS_MAX,
                           STM32_VOS3_FLASH_14WS_MAX,
                           STM32_VOS3_FLASH_15WS_MAX}
};

/**
 * @brief   System limits for VOS range 4.
 */
static const system_limits_t vos_range4 = {
  .pllin_min            = STM32_VOS4_PLLIN_MIN,
  .pllin_max            = STM32_VOS4_PLLIN_MAX,
  .pllvco_min           = STM32_VOS4_PLLVCO_MIN,
  .pllvco_max           = STM32_VOS4_PLLVCO_MAX,
  .pllp_min             = STM32_VOS4_PLLP_MIN,
  .pllp_max             = STM32_VOS4_PLLP_MAX,
  .pllq_min             = STM32_VOS4_PLLQ_MIN,
  .pllq_max             = STM32_VOS4_PLLQ_MAX,
  .pllr_min             = STM32_VOS4_PLLR_MIN,
  .pllr_max             = STM32_VOS4_PLLR_MAX,
  .sysclk_max           = STM32_VOS4_SYSCLK_MAX,
  .hclk_max             = STM32_VOS4_HCLK_MAX,
  .pclk1_max            = STM32_VOS4_PCLK1_MAX,
  .pclk2_max            = STM32_VOS4_PCLK2_MAX,
  .pclk3_max            = STM32_VOS4_PCLK3_MAX,
  .flash_thresholds     = {STM32_VOS4_FLASH_0WS_MAX,
                           STM32_VOS4_FLASH_1WS_MAX,
                           STM32_VOS4_FLASH_2WS_MAX,
                           STM32_VOS4_FLASH_3WS_MAX,
                           STM32_VOS4_FLASH_4WS_MAX,
                           STM32_VOS4_FLASH_5WS_MAX,
                           STM32_VOS4_FLASH_6WS_MAX,
                           STM32_VOS4_FLASH_7WS_MAX,
                           STM32_VOS4_FLASH_8WS_MAX,
                           STM32_VOS4_FLASH_9WS_MAX,
                           STM32_VOS4_FLASH_10WS_MAX,
                           STM32_VOS4_FLASH_11WS_MAX,
                           STM32_VOS4_FLASH_12WS_MAX,
                           STM32_VOS4_FLASH_13WS_MAX,
                           STM32_VOS4_FLASH_14WS_MAX,
                           STM32_VOS4_FLASH_15WS_MAX}
};
#endif

/*===========================================================================*/
/* Driver local functions.                                                   */
/*===========================================================================*/

