emirhan-sonmez/chibios/os/hal/ports/STM32/STM32U5xx/hal_lld.c
__STATIC_INLINE void hal_lld_set_coreclock(halfreq_t coreclock) {

  SystemCoreClock = (uint32_t)coreclock;
}

/**
 * @brief   Configures the PWR unit.
 * @note    VOSR is handled by the clock switch path.
 */
__STATIC_INLINE void hal_lld_set_static_pwr(void) {

  /* PWR clock enabled.*/
  rccEnablePWRInterface(false);

  /* Enable write access to Backup domain.*/
  halRegWrite32X(&PWR->DBPR, PWR_DBPR_DBP, true);

  /* Static settings for PWR registers.*/
  halRegWrite32X(&PWR->CR1,      STM32_PWR_CR1,      true);
  halRegWrite32X(&PWR->CR2,      STM32_PWR_CR2,      true);
  halRegWrite32X(&PWR->CR3,      STM32_PWR_CR3,      true);
  halRegWrite32X(&PWR->SVMCR,    STM32_PWR_SVMCR,    true);
  halRegWrite32X(&PWR->WUCR1,    STM32_PWR_WUCR1,    true);
  halRegWrite32X(&PWR->WUCR2,    STM32_PWR_WUCR2,    true);
  halRegWrite32X(&PWR->WUCR3,    STM32_PWR_WUCR3,    true);
  halRegWrite32X(&PWR->BDCR1,    STM32_PWR_BDCR1,    true);
  halRegWrite32X(&PWR->BDCR2,    STM32_PWR_BDCR2,    true);
  halRegWrite32X(&PWR->UCPDR,    STM32_PWR_UCPDR,    true);
  halRegWrite32X(&PWR->SECCFGR,  STM32_PWR_SECCFGR,  true);
  halRegWrite32X(&PWR->PRIVCFGR, STM32_PWR_PRIVCFGR, true);
  halRegWrite32X(&PWR->APCR,     STM32_PWR_APCR,     true);
  halRegWrite32X(&PWR->PUCRA,    STM32_PWR_PUCRA,    true);
  halRegWrite32X(&PWR->PDCRA,    STM32_PWR_PDCRA,    true);
  halRegWrite32X(&PWR->PUCRB,    STM32_PWR_PUCRB,    true);
  halRegWrite32X(&PWR->PDCRB,    STM32_PWR_PDCRB,    true);
  halRegWrite32X(&PWR->PUCRC,    STM32_PWR_PUCRC,    true);
  halRegWrite32X(&PWR->PDCRC,    STM32_PWR_PDCRC,    true);
  halRegWrite32X(&PWR->PUCRD,    STM32_PWR_PUCRD,    true);
  halRegWrite32X(&PWR->PDCRD,    STM32_PWR_PDCRD,    true);
  halRegWrite32X(&PWR->PUCRE,    STM32_PWR_PUCRE,    true);
  halRegWrite32X(&PWR->PDCRE,    STM32_PWR_PDCRE,    true);
  halRegWrite32X(&PWR->PUCRF,    STM32_PWR_PUCRF,    true);
  halRegWrite32X(&PWR->PDCRF,    STM32_PWR_PDCRF,    true);
  halRegWrite32X(&PWR->PUCRG,    STM32_PWR_PUCRG,    true);
  halRegWrite32X(&PWR->PDCRG,    STM32_PWR_PDCRG,    true);
  halRegWrite32X(&PWR->PUCRH,    STM32_PWR_PUCRH,    true);
  halRegWrite32X(&PWR->PDCRH,    STM32_PWR_PDCRH,    true);
#if STM32_HAS_GPIOI
  halRegWrite32X(&PWR->PUCRI,    STM32_PWR_PUCRI,    true);
  halRegWrite32X(&PWR->PDCRI,    STM32_PWR_PDCRI,    true);
#endif
#if STM32_HAS_GPIOJ
  halRegWrite32X(&PWR->PUCRJ,    STM32_PWR_PUCRJ,    true);
  halRegWrite32X(&PWR->PDCRJ,    STM32_PWR_PDCRJ,    true);
#endif
}

/**
 * @brief   Initializes static peripheral clock selectors.
 */
__STATIC_INLINE void hal_lld_set_static_clocks(const halclkcfg_t *ccp) {

  halRegWrite32X(&RCC->CCIPR1, ccp->rcc_ccipr1, true);
  halRegWrite32X(&RCC->CCIPR2, ccp->rcc_ccipr2, true);
  halRegWrite32X(&RCC->CCIPR3, ccp->rcc_ccipr3, true);
}

/**
 * @brief   Programs a PLL while it is disabled.
 */
__STATIC_INLINE void hal_lld_pll_setup(uint32_t pll,
                                       const stm32_pllcfg_t *pllp) {

  switch (pll) {
  case 0U:
    halRegWrite32X(&RCC->PLL1CFGR,  pllp->cfgr,  true);
    halRegWrite32X(&RCC->PLL1DIVR,  pllp->divr,  true);
    halRegWrite32X(&RCC->PLL1FRACR, pllp->fracr, true);
    break;
  case 1U:
    halRegWrite32X(&RCC->PLL2CFGR,  pllp->cfgr,  true);
    halRegWrite32X(&RCC->PLL2DIVR,  pllp->divr,  true);
    halRegWrite32X(&RCC->PLL2FRACR, pllp->fracr, true);
    break;
  default:
    halRegWrite32X(&RCC->PLL3CFGR,  pllp->cfgr,  true);
    halRegWrite32X(&RCC->PLL3DIVR,  pllp->divr,  true);
    halRegWrite32X(&RCC->PLL3FRACR, pllp->fracr, true);
    break;
  }
}

/**
 * @brief   Switches to a different clock configuration.
 *
 * @param[in] ccp       pointer to clock a @p halclkcfg_t structure
 * @return              The clock switch result.
 * @retval false        if the clock switch succeeded
 * @retval true         if the clock switch failed
 *
 * @notapi
 */
static bool hal_lld_clock_configure(const halclkcfg_t *ccp) {
  uint32_t cr, wtmask;
#if defined(PWR_VOSR_USBPWREN)
  uint32_t usbpower;

  /* Preserve an active OTG_HS transceiver across dynamic clock changes.*/
  usbpower = PWR->VOSR & (PWR_VOSR_USBPWREN | PWR_VOSR_USBBOOSTEN);
#endif

  /* Use the safest flash latency while the current clock tree is unknown.*/
  halRegWrite32X(&FLASH->ACR, FLASH_ACR_LATENCY_15WS, true);

  /* Enter a known MSIS-based state before applying the requested tree.*/
  halRegWrite32X(&RCC->ICSCR1, STM32_RCC_ICSCR1_RESET, true);
  halRegWrite32X(&RCC->CR,     STM32_RCC_CR_RESET, true);
  if (halRegWaitAllSet32X(&RCC->CR,
                          RCC_CR_MSISRDY | RCC_CR_MSIKRDY,
                          STM32_OSCILLATORS_STARTUP_TIME,
                          NULL)) {
    return true;
  }

  halRegWrite32X(&RCC->CFGR2, STM32_RCC_CFGR2_RESET, true);
  halRegWrite32X(&RCC->CFGR3, STM32_RCC_CFGR3_RESET, true);
  halRegWrite32X(&RCC->CFGR1, STM32_RCC_CFGR1_RESET, true);
  if (halRegWaitMatch32X(&RCC->CFGR1,
                         RCC_CFGR1_SWS_Msk,
                         0U,
                         STM32_SYSCLK_SWITCH_TIME,
                         NULL)) {
    return true;
  }

  /* At this point SYSCLK is MSIS/4 MHz with reset bus prescalers.*/
  hal_lld_set_coreclock(4000000U);
  halRegWrite32X(&FLASH->ACR, STM32_FLASH_ACR_RESET, true);

  /* Voltage scaling must be ready before high-frequency clocks are used.*/
#if defined(PWR_VOSR_USBPWREN)
  halRegWrite32X(&PWR->VOSR,
                 (ccp->pwr_vosr & ~PWR_VOSR_BOOSTEN) | usbpower,
                 true);
#else
  halRegWrite32X(&PWR->VOSR, ccp->pwr_vosr & ~PWR_VOSR_BOOSTEN, true);
#endif
  if (halRegWaitAllSet32X(&PWR->VOSR,
                          PWR_VOSR_VOSRDY,
                          STM32_REGULATORS_TRANSITION_TIME,
                          NULL)) {
    return true;
  }

  /* MSI ranges and bias selection. MSIRGSEL is enforced for determinism.*/
  halRegWrite32X(&RCC->ICSCR1,
                 ccp->rcc_icscr1 | RCC_ICSCR1_MSIRGSEL_ICSCR1,
                 true);

  /* Backup-domain clock sources and selectors.*/
  halRegWrite32X(&RCC->BDCR, ccp->rcc_bdcr, true);
  wtmask = 0U;
  if ((ccp->rcc_bdcr & RCC_BDCR_LSEON) != 0U) {
    wtmask |= RCC_BDCR_LSERDY;
  }
  if ((ccp->rcc_bdcr & RCC_BDCR_LSION) != 0U) {
    wtmask |= RCC_BDCR_LSIRDY;
  }
  if (halRegWaitAllSet32X(&RCC->BDCR,
                          wtmask,
                          STM32_OSCILLATORS_STARTUP_TIME,
                          NULL)) {
    return true;
  }

  /* Start configured non-PLL oscillators while keeping MSIS available.*/
  cr = (ccp->rcc_cr & ~(RCC_CR_PLL1ON | RCC_CR_PLL2ON | RCC_CR_PLL3ON)) |
       RCC_CR_MSISON;
  if ((cr & (RCC_CR_HSEON | RCC_CR_HSEBYP)) ==
      (RCC_CR_HSEON | RCC_CR_HSEBYP)) {
    /* HSEBYP must be latched while HSEON is still cleared.*/
    halRegWrite32X(&RCC->CR, cr & ~RCC_CR_HSEON, true);
  }
  halRegWrite32X(&RCC->CR, cr, true);

  wtmask = RCC_CR_MSISRDY;
  if ((ccp->rcc_cr & RCC_CR_MSIKON) != 0U) {
    wtmask |= RCC_CR_MSIKRDY;
  }
  if ((ccp->rcc_cr & RCC_CR_HSION) != 0U) {
    wtmask |= RCC_CR_HSIRDY;
  }
  if ((ccp->rcc_cr & RCC_CR_HSI48ON) != 0U) {
    wtmask |= RCC_CR_HSI48RDY;
  }
  if ((ccp->rcc_cr & RCC_CR_SHSION) != 0U) {
    wtmask |= RCC_CR_SHSIRDY;
  }
  if ((ccp->rcc_cr & RCC_CR_HSEON) != 0U) {
    wtmask |= RCC_CR_HSERDY;
  }
  if (halRegWaitAllSet32X(&RCC->CR,
                          wtmask,
                          STM32_OSCILLATORS_STARTUP_TIME,
                          NULL)) {
    return true;
  }

  /* PLL setup and activation. Fractional mode is intentionally unused yet.*/
  hal_lld_pll_setup(0U, &ccp->plls[0]);
  hal_lld_pll_setup(1U, &ccp->plls[1]);
  hal_lld_pll_setup(2U, &ccp->plls[2]);

  if ((ccp->pwr_vosr & PWR_VOSR_BOOSTEN) != 0U) {
#if defined(PWR_VOSR_USBPWREN)
    halRegWrite32X(&PWR->VOSR, ccp->pwr_vosr | usbpower, true);
#else
    halRegWrite32X(&PWR->VOSR, ccp->pwr_vosr, true);
#endif
    if (halRegWaitAllSet32X(&PWR->VOSR,
                            PWR_VOSR_BOOSTRDY,
                            STM32_REGULATORS_TRANSITION_TIME,
                            NULL)) {
      return true;
    }
  }

