emirhan-sonmez/chibios/os/hal/ports/STM32/STM32U5xx/hal_lld.c
  cr = ccp->rcc_cr | RCC_CR_MSISON;
  halRegWrite32X(&RCC->CR, cr, true);

  wtmask = 0U;
  if ((ccp->rcc_cr & RCC_CR_PLL1ON) != 0U) {
    wtmask |= RCC_CR_PLL1RDY;
  }
  if ((ccp->rcc_cr & RCC_CR_PLL2ON) != 0U) {
    wtmask |= RCC_CR_PLL2RDY;
  }
  if ((ccp->rcc_cr & RCC_CR_PLL3ON) != 0U) {
    wtmask |= RCC_CR_PLL3RDY;
  }
  if (halRegWaitAllSet32X(&RCC->CR, wtmask, STM32_PLL_STARTUP_TIME, NULL)) {
    return true;
  }

  /* Static peripheral selectors are independent from SYSCLK switching.*/
  hal_lld_set_static_clocks(ccp);

  /* Final prescalers, flash latency and SYSCLK source.*/
  halRegWrite32X(&RCC->CFGR2, ccp->rcc_cfgr2, true);
  halRegWrite32X(&RCC->CFGR3, ccp->rcc_cfgr3, true);
  halRegWrite32X(&FLASH->ACR, ccp->flash_acr, true);
  halRegWrite32X(&RCC->CFGR1, ccp->rcc_cfgr1, true);
  if (halRegWaitMatch32X(&RCC->CFGR1,
                         RCC_CFGR1_SWS_Msk,
                         (ccp->rcc_cfgr1 & RCC_CFGR1_SW_Msk) << RCC_CFGR1_SWS_Pos,
                         STM32_SYSCLK_SWITCH_TIME,
                         NULL)) {
    return true;
  }

  /* MSIS can be disabled now if it is not part of the requested tree.*/
  halRegWrite32X(&RCC->CR, ccp->rcc_cr, true);

  return false;
}

#if defined(HAL_LLD_USE_CLOCK_MANAGEMENT) || defined(__DOXYGEN__)
/**
 * @brief   Checks a frequency against optional limits.
 *
 * @param[in] freq      frequency to be checked
 * @param[in] min       minimum frequency, zero if not checked
 * @param[in] max       maximum frequency, zero if not checked
 * @return              The frequency check result.
 * @retval false        if the frequency is within limits
 * @retval true         if the frequency is outside limits
 *
 * @notapi
 */
static bool hal_lld_clock_check_limit(halfreq_t freq,
                                      halfreq_t min,
                                      halfreq_t max) {

  if ((min != 0U) && (freq < min)) {
    return true;
  }

  if ((max != 0U) && (freq > max)) {
    return true;
  }

  return false;
}

/**
 * @brief   Returns the MSI range frequency.
 *
 * @param[in] range     encoded MSIS/MSIK range field value
 * @return              The selected range frequency
 *
 * @notapi
 */
static halfreq_t hal_lld_get_msi_frequency(uint32_t range) {
  static const halfreq_t msirange[16] = {
    48000000U, 24000000U, 16000000U, 12000000U,
     4000000U,  2000000U,  1333333U,  1000000U,
     3072000U,  1536000U,  1024000U,   768000U,
      400000U,   200000U,   133000U,   100000U
  };

  return msirange[range & 15U];
}

/**
 * @brief   Recalculates one PLL.
 *
 * @param[in] ccp       pointer to clock a @p halclkcfg_t structure
 * @param[in] pll       PLL index
 * @param[in] input     selected PLL input frequency
 * @param[in] slp       pointer to current system limits
 * @param[out] refp     pointer to calculated PLL reference frequency
 * @param[out] vcop     pointer to calculated PLL VCO frequency
 * @param[out] pp       pointer to calculated PLL P output frequency
 * @param[out] qp       pointer to calculated PLL Q output frequency
 * @param[out] rp       pointer to calculated PLL R output frequency
 * @return              The frequency calculation result.
 * @retval false        if the PLL settings look valid
 * @retval true         if the PLL settings look invalid
 *
 * @notapi
 */
static bool hal_lld_clock_check_pll(const halclkcfg_t *ccp,
                                    uint32_t pll,
                                    halfreq_t input,
                                    const system_limits_t *slp,
                                    halfreq_t *refp,
                                    halfreq_t *vcop,
                                    halfreq_t *pp,
                                    halfreq_t *qp,
                                    halfreq_t *rp) {
  const stm32_pllcfg_t *pllp = &ccp->plls[pll];
  uint32_t mdiv, ndiv, n, onmask, pen, qen, ren;
  uint32_t mskm, posm, mskn, posn, mskp, posp, mskq, posq, mskr, posr;
  halfreq_t refclk, vcoclk;

  *refp = 0U;
  *vcop = 0U;
  *pp   = 0U;
  *qp   = 0U;
  *rp   = 0U;

  switch (pll) {
  case 0U:
    onmask = RCC_CR_PLL1ON;
    pen   = RCC_PLL1CFGR_PLL1PEN;
    qen   = RCC_PLL1CFGR_PLL1QEN;
    ren   = RCC_PLL1CFGR_PLL1REN;
    mskm  = RCC_PLL1CFGR_PLL1M_Msk;
    posm  = RCC_PLL1CFGR_PLL1M_Pos;
    mskn  = RCC_PLL1DIVR_PLL1N_Msk;
    posn  = RCC_PLL1DIVR_PLL1N_Pos;
    mskp  = RCC_PLL1DIVR_PLL1P_Msk;
    posp  = RCC_PLL1DIVR_PLL1P_Pos;
    mskq  = RCC_PLL1DIVR_PLL1Q_Msk;
    posq  = RCC_PLL1DIVR_PLL1Q_Pos;
    mskr  = RCC_PLL1DIVR_PLL1R_Msk;
    posr  = RCC_PLL1DIVR_PLL1R_Pos;
    break;
  case 1U:
    onmask = RCC_CR_PLL2ON;
    pen   = RCC_PLL2CFGR_PLL2PEN;
    qen   = RCC_PLL2CFGR_PLL2QEN;
    ren   = RCC_PLL2CFGR_PLL2REN;
    mskm  = RCC_PLL2CFGR_PLL2M_Msk;
    posm  = RCC_PLL2CFGR_PLL2M_Pos;
    mskn  = RCC_PLL2DIVR_PLL2N_Msk;
    posn  = RCC_PLL2DIVR_PLL2N_Pos;
    mskp  = RCC_PLL2DIVR_PLL2P_Msk;
    posp  = RCC_PLL2DIVR_PLL2P_Pos;
    mskq  = RCC_PLL2DIVR_PLL2Q_Msk;
    posq  = RCC_PLL2DIVR_PLL2Q_Pos;
    mskr  = RCC_PLL2DIVR_PLL2R_Msk;
    posr  = RCC_PLL2DIVR_PLL2R_Pos;
    break;
  default:
    onmask = RCC_CR_PLL3ON;
    pen   = RCC_PLL3CFGR_PLL3PEN;
    qen   = RCC_PLL3CFGR_PLL3QEN;
    ren   = RCC_PLL3CFGR_PLL3REN;
    mskm  = RCC_PLL3CFGR_PLL3M_Msk;
    posm  = RCC_PLL3CFGR_PLL3M_Pos;
    mskn  = RCC_PLL3DIVR_PLL3N_Msk;
    posn  = RCC_PLL3DIVR_PLL3N_Pos;
    mskp  = RCC_PLL3DIVR_PLL3P_Msk;
    posp  = RCC_PLL3DIVR_PLL3P_Pos;
    mskq  = RCC_PLL3DIVR_PLL3Q_Msk;
    posq  = RCC_PLL3DIVR_PLL3Q_Pos;
    mskr  = RCC_PLL3DIVR_PLL3R_Msk;
    posr  = RCC_PLL3DIVR_PLL3R_Pos;
    break;
  }

  if ((ccp->rcc_cr & onmask) == 0U) {
    return false;
  }

  mdiv = ((pllp->cfgr & mskm) >> posm) + 1U;
  ndiv = ((pllp->divr & mskn) >> posn) + 1U;

  refclk = input / (halfreq_t)mdiv;
  if ((refclk == 0U) ||
      hal_lld_clock_check_limit(refclk, slp->pllin_min, slp->pllin_max)) {
    return true;
  }

  vcoclk = refclk * (halfreq_t)ndiv;
  if ((vcoclk == 0U) ||
      hal_lld_clock_check_limit(vcoclk, slp->pllvco_min, slp->pllvco_max)) {
    return true;
  }

  if ((pllp->cfgr & pen) != 0U) {
    n = ((pllp->divr & mskp) >> posp) + 1U;
    *pp = vcoclk / (halfreq_t)n;
    if ((*pp == 0U) ||
        hal_lld_clock_check_limit(*pp, slp->pllp_min, slp->pllp_max)) {
      return true;
    }
  }

  if ((pllp->cfgr & qen) != 0U) {
    n = ((pllp->divr & mskq) >> posq) + 1U;
    *qp = vcoclk / (halfreq_t)n;
    if ((*qp == 0U) ||
        hal_lld_clock_check_limit(*qp, slp->pllq_min, slp->pllq_max)) {
      return true;
    }
  }

