emirhan-sonmez/chibios/os/hal/ports/STM32/STM32U5xx/hal_lld.c
  if ((pllp->cfgr & ren) != 0U) {
    n = ((pllp->divr & mskr) >> posr) + 1U;
    *rp = vcoclk / (halfreq_t)n;
    if ((*rp == 0U) ||
        hal_lld_clock_check_limit(*rp, slp->pllr_min, slp->pllr_max)) {
      return true;
    }
  }

  *refp = refclk;
  *vcop = vcoclk;

  return false;
}

/**
 * @brief   Recalculates the clock tree frequencies.
 *
 * @param[in] ccp       pointer to clock a @p halclkcfg_t structure
 * @return              The frequency calculation result.
 * @retval false        if the clock settings look valid
 * @retval true         if the clock settings look invalid
 *
 * @notapi
 */
static bool hal_lld_clock_check_tree(const halclkcfg_t *ccp) {
  static const uint32_t hprediv[16] = {1U, 1U, 1U, 1U, 1U, 1U, 1U, 1U,
                                       2U, 4U, 8U, 16U, 64U, 128U, 256U, 512U};
  static const uint32_t pprediv[8] = {1U, 1U, 1U, 1U, 2U, 4U, 8U, 16U};
  static const uint32_t mcoprediv[5] = {1U, 2U, 4U, 8U, 16U};
  const system_limits_t *slp;
  uint32_t n, flashws;
  halfreq_t hsi16clk = 0U, hsi48clk = 0U, shsiclk = 0U, hseclk = 0U;
  halfreq_t msisclk = 0U, msikclk = 0U, lsiclk = 0U, lseclk = 0U;
  halfreq_t pll1inclk, pll1refclk, pll1vcoclk;
  halfreq_t pll1pclk, pll1qclk, pll1rclk;
  halfreq_t pll2inclk, pll2refclk, pll2vcoclk;
  halfreq_t pll2pclk, pll2qclk, pll2rclk;
  halfreq_t pll3inclk, pll3refclk, pll3vcoclk;
  halfreq_t pll3pclk, pll3qclk, pll3rclk;
  halfreq_t sysclk, hclk, pclk1, pclk2, pclk3, pclk1tim, pclk2tim, mcoclk;

  switch (ccp->pwr_vosr & PWR_VOSR_VOS_Msk) {
  case PWR_VOSR_VOS_RANGE1:
    slp = &vos_range1;
    break;
  case PWR_VOSR_VOS_RANGE2:
    slp = &vos_range2;
    break;
  case PWR_VOSR_VOS_RANGE3:
    slp = &vos_range3;
    break;
  case PWR_VOSR_VOS_RANGE4:
    slp = &vos_range4;
    break;
  default:
    return true;
  }

  if ((ccp->rcc_cr & RCC_CR_HSION) != 0U) {
    hsi16clk = STM32_HSI16_SOURCE_FREQ;
  }

  if ((ccp->rcc_cr & RCC_CR_HSI48ON) != 0U) {
    hsi48clk = STM32_HSI48_SOURCE_FREQ;
  }

  if ((ccp->rcc_cr & RCC_CR_SHSION) != 0U) {
    shsiclk = STM32_SHSI_SOURCE_FREQ;
  }

  if ((ccp->rcc_cr & RCC_CR_HSEON) != 0U) {
    hseclk = STM32_HSECLK;
  }

  if ((ccp->rcc_cr & RCC_CR_MSISON) != 0U) {
    n = (ccp->rcc_icscr1 & RCC_ICSCR1_MSISRANGE_Msk) >>
        RCC_ICSCR1_MSISRANGE_Pos;
    msisclk = hal_lld_get_msi_frequency(n);
  }

  if ((ccp->rcc_cr & RCC_CR_MSIKON) != 0U) {
    n = (ccp->rcc_icscr1 & RCC_ICSCR1_MSIKRANGE_Msk) >>
        RCC_ICSCR1_MSIKRANGE_Pos;
    msikclk = hal_lld_get_msi_frequency(n);
  }

  if ((ccp->rcc_bdcr & RCC_BDCR_LSEON) != 0U) {
    lseclk = STM32_LSECLK;
  }

  if ((ccp->rcc_bdcr & RCC_BDCR_LSION) != 0U) {
    lsiclk = ((ccp->rcc_bdcr & RCC_BDCR_LSIPREDIV) != 0U) ? 250U : 32000U;
  }

  switch (ccp->plls[0].cfgr & RCC_PLL1CFGR_PLL1SRC_Msk) {
  case RCC_PLL1CFGR_PLL1SRC_MSIS:
    pll1inclk = msisclk;
    break;
  case RCC_PLL1CFGR_PLL1SRC_HSI16:
    pll1inclk = hsi16clk;
    break;
  case RCC_PLL1CFGR_PLL1SRC_HSE:
    pll1inclk = hseclk;
    break;
  default:
    pll1inclk = 0U;
  }

  switch (ccp->plls[1].cfgr & RCC_PLL2CFGR_PLL2SRC_Msk) {
  case RCC_PLL2CFGR_PLL2SRC_MSIS:
    pll2inclk = msisclk;
    break;
  case RCC_PLL2CFGR_PLL2SRC_HSI16:
    pll2inclk = hsi16clk;
    break;
  case RCC_PLL2CFGR_PLL2SRC_HSE:
    pll2inclk = hseclk;
    break;
  default:
    pll2inclk = 0U;
  }

  switch (ccp->plls[2].cfgr & RCC_PLL3CFGR_PLL3SRC_Msk) {
  case RCC_PLL3CFGR_PLL3SRC_MSIS:
    pll3inclk = msisclk;
    break;
  case RCC_PLL3CFGR_PLL3SRC_HSI16:
    pll3inclk = hsi16clk;
    break;
  case RCC_PLL3CFGR_PLL3SRC_HSE:
    pll3inclk = hseclk;
    break;
  default:
    pll3inclk = 0U;
  }

  if (hal_lld_clock_check_pll(ccp, 0U, pll1inclk, slp,
                              &pll1refclk, &pll1vcoclk,
                              &pll1pclk, &pll1qclk, &pll1rclk)) {
    return true;
  }

  if (hal_lld_clock_check_pll(ccp, 1U, pll2inclk, slp,
                              &pll2refclk, &pll2vcoclk,
                              &pll2pclk, &pll2qclk, &pll2rclk)) {
    return true;
  }

  if (hal_lld_clock_check_pll(ccp, 2U, pll3inclk, slp,
                              &pll3refclk, &pll3vcoclk,
                              &pll3pclk, &pll3qclk, &pll3rclk)) {
    return true;
  }

  switch (ccp->rcc_cfgr1 & RCC_CFGR1_SW_Msk) {
  case RCC_CFGR1_SW_MSIS:
    sysclk = msisclk;
    break;
  case RCC_CFGR1_SW_HSI16:
    sysclk = hsi16clk;
    break;
  case RCC_CFGR1_SW_HSE:
    sysclk = hseclk;
    break;
  case RCC_CFGR1_SW_PLL1R:
    sysclk = pll1rclk;
    break;
  default:
    sysclk = 0U;
  }

  if ((sysclk == 0U) || (sysclk > slp->sysclk_max)) {
    return true;
  }

  hclk = sysclk / hprediv[(ccp->rcc_cfgr2 & RCC_CFGR2_HPRE_Msk) >>
                          RCC_CFGR2_HPRE_Pos];
  if (hclk > slp->hclk_max) {
    return true;
  }

  n = pprediv[(ccp->rcc_cfgr2 & RCC_CFGR2_PPRE1_Msk) >> RCC_CFGR2_PPRE1_Pos];
  pclk1 = hclk / n;
  pclk1tim = (n < 2U) ? pclk1 : (pclk1 * 2U);
  if (pclk1 > slp->pclk1_max) {
    return true;
  }

  n = pprediv[(ccp->rcc_cfgr2 & RCC_CFGR2_PPRE2_Msk) >> RCC_CFGR2_PPRE2_Pos];
  pclk2 = hclk / n;
  pclk2tim = (n < 2U) ? pclk2 : (pclk2 * 2U);
  if (pclk2 > slp->pclk2_max) {
    return true;
  }

  n = pprediv[(ccp->rcc_cfgr3 & RCC_CFGR3_PPRE3_Msk) >> RCC_CFGR3_PPRE3_Pos];
  pclk3 = hclk / n;
  if (pclk3 > slp->pclk3_max) {
    return true;
  }

  switch (ccp->rcc_cfgr1 & RCC_CFGR1_MCOSEL_Msk) {
  case RCC_CFGR1_MCOSEL_NOCLOCK:
    mcoclk = 0U;
    break;
  case RCC_CFGR1_MCOSEL_SYSCLK:
    mcoclk = sysclk;
    break;
  case RCC_CFGR1_MCOSEL_MSIS:
    mcoclk = msisclk;
    break;
  case RCC_CFGR1_MCOSEL_HSI16:
    mcoclk = hsi16clk;
    break;
  case RCC_CFGR1_MCOSEL_HSE:
    mcoclk = hseclk;
    break;
  case RCC_CFGR1_MCOSEL_PLL1R:
    mcoclk = pll1rclk;
    break;
  case RCC_CFGR1_MCOSEL_LSI:
    mcoclk = lsiclk;
    break;
  case RCC_CFGR1_MCOSEL_LSE:
    mcoclk = lseclk;
    break;
  case RCC_CFGR1_MCOSEL_HSI48:
    mcoclk = hsi48clk;
    break;
  case RCC_CFGR1_MCOSEL_MSIK:
    mcoclk = msikclk;
    break;
  default:
    return true;
  }

