emirhan-sonmez/chibios/os/hal/ports/STM32/STM32U5xx/hal_lld.c
  n = (ccp->rcc_cfgr1 & RCC_CFGR1_MCOPRE_Msk) >> RCC_CFGR1_MCOPRE_Pos;
  if (n >= 5U) {
    return true;
  }
  mcoclk /= mcoprediv[n];

  flashws = ((ccp->flash_acr & FLASH_ACR_LATENCY_Msk) >>
             FLASH_ACR_LATENCY_Pos);
  if (flashws >= STM32_WS_THRESHOLDS) {
    return true;
  }
  if (hclk > slp->flash_thresholds[flashws]) {
    return true;
  }

  clock_points[CLK_HSI16]   = hsi16clk;
  clock_points[CLK_HSI48]   = hsi48clk;
  clock_points[CLK_SHSI]    = shsiclk;
  clock_points[CLK_HSE]     = hseclk;
  clock_points[CLK_MSIS]    = msisclk;
  clock_points[CLK_MSIK]    = msikclk;
  clock_points[CLK_PLL1P]   = pll1pclk;
  clock_points[CLK_PLL1Q]   = pll1qclk;
  clock_points[CLK_PLL1R]   = pll1rclk;
  clock_points[CLK_PLL2P]   = pll2pclk;
  clock_points[CLK_PLL2Q]   = pll2qclk;
  clock_points[CLK_PLL2R]   = pll2rclk;
  clock_points[CLK_PLL3P]   = pll3pclk;
  clock_points[CLK_PLL3Q]   = pll3qclk;
  clock_points[CLK_PLL3R]   = pll3rclk;
  clock_points[CLK_SYSCLK]  = sysclk;
  clock_points[CLK_HCLK]    = hclk;
  clock_points[CLK_PCLK1]   = pclk1;
  clock_points[CLK_PCLK1TIM] = pclk1tim;
  clock_points[CLK_PCLK2]   = pclk2;
  clock_points[CLK_PCLK2TIM] = pclk2tim;
  clock_points[CLK_PCLK3]   = pclk3;
  clock_points[CLK_MCO]     = mcoclk;

  return false;
}
#endif /* defined(HAL_LLD_USE_CLOCK_MANAGEMENT) */

/*===========================================================================*/
/* Driver interrupt handlers.                                                */
/*===========================================================================*/

/*===========================================================================*/
/* Driver exported functions.                                                */
/*===========================================================================*/

/**
 * @brief   Low level HAL driver initialization.
 *
 * @notapi
 */
void hal_lld_init(void) {

  /* Frequency after applying the default configuration or assumed set by the
     bootloader in case of NO_INIT.*/
  hal_lld_set_coreclock(STM32_HCLK_CLOCK);

  /* NVIC initialization.*/
  nvicInit();

  /* IRQ subsystem initialization.*/
  irqInit();
}

#if (HAL_USE_USB == TRUE) && STM32_HAS_OTG2
/**
 * @brief   Enables and starts the integrated OTG2 high-speed PHY.
 *
 * @notapi
 */
void stm32_otg2_phy_start(void) {

  /* The USB power booster must be ready before clocking the PHY.*/
  PWR->VOSR &= ~PWR_VOSR_VDD11USBDIS;
  PWR->VOSR |= PWR_VOSR_USBPWREN | PWR_VOSR_USBBOOSTEN;
  while ((PWR->VOSR & PWR_VOSR_USBBOOSTRDY) == 0U) {
  }

  /* Integrated high-speed PHY clocks.*/
  rccEnableSYSCFG(true);
  rccEnableUSBPHYC(true);

  /* Reference clock and mandatory PHY tuning values from the RM.*/
  SYSCFG->OTGHSPHYCR = STM32_OTGHS_PHY_CLKSEL;
  SYSCFG->OTGHSPHYTUNER2 =
    (SYSCFG->OTGHSPHYTUNER2 &
     ~(SYSCFG_OTGHSPHYTUNER2_COMPDISTUNE_Msk |
       SYSCFG_OTGHSPHYTUNER2_SQRXTUNE_Msk)) |
    SYSCFG_OTGHSPHYTUNER2_COMPDISTUNE_1;

  /* The digital and analog PHY blocks require separate startup delays.*/
  SYSCFG->OTGHSPHYCR |= SYSCFG_OTGHSPHYCR_EN;
  osalSysPolledDelayX(OSAL_MS2RTC(STM32_HCLK, 2U));
  SYSCFG->OTGHSPHYCR |= SYSCFG_OTGHSPHYCR_PDCTRL;
  osalSysPolledDelayX(OSAL_MS2RTC(STM32_HCLK, 2U));
}

/**
 * @brief   Stops and disables the integrated OTG2 high-speed PHY.
 *
 * @notapi
 */
void stm32_otg2_phy_stop(void) {

  SYSCFG->OTGHSPHYCR &= ~(SYSCFG_OTGHSPHYCR_EN |
                          SYSCFG_OTGHSPHYCR_PDCTRL);
  rccDisableUSBPHYC();
  PWR->VOSR &= ~(PWR_VOSR_USBPWREN | PWR_VOSR_USBBOOSTEN);
}
#endif

/**
 * @brief   STM32U5xx clocks and PLL initialization.
 * @note    This function is invoked early by the startup files, non-automatic
 *          variables are not initialized.
 *
 * @special
 */
void stm32_clock_init(void) {

  /* DWT cycles counter enabled, used for timeouts.*/
  halRegSet32X(&DWT->CTRL, DWT_CTRL_CYCCNTENA_Msk, true);

#if !STM32_NO_INIT
  /* Assuming MSIS/4 MHz as post-reset clock.*/
  hal_lld_set_coreclock(4000000U);

  /* Reset of all peripherals.
     Note, GPIOs are not reset because initialized before this point in
     board files.*/
  rccResetAHB1(~0);
  rccResetAHB2R1(~STM32_GPIO_EN_MASK);
  rccResetAHB2R2(~0);
  rccResetAHB3(~0);
  rccResetAPB1R1(~0);
  rccResetAPB1R2(~0);
  rccResetAPB2(~0);
  rccResetAPB3(~0);

  /* RTC APB clock enable.*/
#if (HAL_USE_RTC == TRUE) && defined(RCC_APB3ENR_RTCAPBEN)
  rccEnableAPB3(RCC_APB3ENR_RTCAPBEN, true);
#endif

  /* Static PWR configurations.*/
  hal_lld_set_static_pwr();

  /* Selecting the default clock configuration. */
  halSftFailOnError(hal_lld_clock_configure(&hal_clkcfg_default), "clkinit");
#endif /* STM32_NO_INIT */
}

#if defined(HAL_LLD_USE_CLOCK_MANAGEMENT) || defined(__DOXYGEN__)
/**
 * @brief   Switches to a different clock configuration.
 *
 * @param[in] ccp       pointer to clock a @p halclkcfg_t structure
 * @return              The clock switch result.
 * @retval false        if the clock switch succeeded
 * @retval true         if the clock switch failed
 *
 * @notapi
 */
bool hal_lld_clock_switch_mode(const halclkcfg_t *ccp) {

  if (hal_lld_clock_check_tree(ccp)) {
    return true;
  }

  if (hal_lld_clock_configure(ccp)) {
    return true;
  }

  /* Updating the current system clock setting value.*/
  hal_lld_set_coreclock(hal_lld_get_clock_point(CLK_HCLK));

  return false;
}

/**
 * @brief   Returns the frequency of a clock point in Hz.
 *
 * @param[in] clkpt     clock point to be returned
 * @return              The clock point frequency in Hz or zero if the
 *                      frequency is unknown.
 *
 * @notapi
 */
halfreq_t hal_lld_get_clock_point(halclkpt_t clkpt) {

  osalDbgAssert(clkpt < CLK_ARRAY_SIZE, "invalid clock point");

  return clock_points[clkpt];
}
#endif /* defined(HAL_LLD_USE_CLOCK_MANAGEMENT) */

/** @} */
